RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_SRC.h
#define SRC_SCR_BT_RELEASE_M7_MASK               (0x2U)
#define SRC_SCR_BT_RELEASE_M7_SHIFT              (1U)
/*! BT_RELEASE_M7
 *  0b0..cm7 core reset is asserted
 *  0b1..cm7 core reset is released
 */
#define SRC_SCR_BT_RELEASE_M7(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SCR_BT_RELEASE_M7_SHIFT)) & SRC_SCR_BT_RELEASE_M7_MASK)
/*! @} */

/*! @name SRMR - SRC Reset Mode Register */
/*! @{ */

#define SRC_SRMR_WDOG_RESET_MODE_MASK            (0x3U)
#define SRC_SRMR_WDOG_RESET_MODE_SHIFT           (0U)
/*! WDOG_RESET_MODE - Wdog reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_WDOG_RESET_MODE(x)              (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_WDOG_RESET_MODE_SHIFT)) & SRC_SRMR_WDOG_RESET_MODE_MASK)

#define SRC_SRMR_WDOG3_RESET_MODE_MASK           (0xCU)
#define SRC_SRMR_WDOG3_RESET_MODE_SHIFT          (2U)
/*! WDOG3_RESET_MODE - Wdog3 reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_WDOG3_RESET_MODE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_WDOG3_RESET_MODE_SHIFT)) & SRC_SRMR_WDOG3_RESET_MODE_MASK)

#define SRC_SRMR_WDOG4_RESET_MODE_MASK           (0x30U)
#define SRC_SRMR_WDOG4_RESET_MODE_SHIFT          (4U)
/*! WDOG4_RESET_MODE - Wdog4 reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_WDOG4_RESET_MODE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_WDOG4_RESET_MODE_SHIFT)) & SRC_SRMR_WDOG4_RESET_MODE_MASK)

#define SRC_SRMR_M4LOCKUP_RESET_MODE_MASK        (0xC0U)
#define SRC_SRMR_M4LOCKUP_RESET_MODE_SHIFT       (6U)
/*! M4LOCKUP_RESET_MODE - M4 core lockup reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_M4LOCKUP_RESET_MODE(x)          (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_M4LOCKUP_RESET_MODE_SHIFT)) & SRC_SRMR_M4LOCKUP_RESET_MODE_MASK)

#define SRC_SRMR_M7LOCKUP_RESET_MODE_MASK        (0x300U)
#define SRC_SRMR_M7LOCKUP_RESET_MODE_SHIFT       (8U)
/*! M7LOCKUP_RESET_MODE - M7 core lockup reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_M7LOCKUP_RESET_MODE(x)          (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_M7LOCKUP_RESET_MODE_SHIFT)) & SRC_SRMR_M7LOCKUP_RESET_MODE_MASK)

#define SRC_SRMR_M4REQ_RESET_MODE_MASK           (0xC00U)
#define SRC_SRMR_M4REQ_RESET_MODE_SHIFT          (10U)
/*! M4REQ_RESET_MODE - M4 request reset configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_M4REQ_RESET_MODE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_M4REQ_RESET_MODE_SHIFT)) & SRC_SRMR_M4REQ_RESET_MODE_MASK)

#define SRC_SRMR_M7REQ_RESET_MODE_MASK           (0x3000U)
#define SRC_SRMR_M7REQ_RESET_MODE_SHIFT          (12U)
/*! M7REQ_RESET_MODE - M7 request reset configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_M7REQ_RESET_MODE(x)             (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_M7REQ_RESET_MODE_SHIFT)) & SRC_SRMR_M7REQ_RESET_MODE_MASK)

#define SRC_SRMR_TEMPSENSE_RESET_MODE_MASK       (0xC000U)
#define SRC_SRMR_TEMPSENSE_RESET_MODE_SHIFT      (14U)
/*! TEMPSENSE_RESET_MODE - Tempsense reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_TEMPSENSE_RESET_MODE(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_TEMPSENSE_RESET_MODE_SHIFT)) & SRC_SRMR_TEMPSENSE_RESET_MODE_MASK)

#define SRC_SRMR_CSU_RESET_MODE_MASK             (0x30000U)
#define SRC_SRMR_CSU_RESET_MODE_SHIFT            (16U)
/*! CSU_RESET_MODE - CSU reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_CSU_RESET_MODE(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_CSU_RESET_MODE_SHIFT)) & SRC_SRMR_CSU_RESET_MODE_MASK)

#define SRC_SRMR_JTAGSW_RESET_MODE_MASK          (0xC0000U)
#define SRC_SRMR_JTAGSW_RESET_MODE_SHIFT         (18U)
/*! JTAGSW_RESET_MODE - Jtag SW reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_JTAGSW_RESET_MODE(x)            (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_JTAGSW_RESET_MODE_SHIFT)) & SRC_SRMR_JTAGSW_RESET_MODE_MASK)

#define SRC_SRMR_OVERVOLT_RESET_MODE_MASK        (0x300000U)
#define SRC_SRMR_OVERVOLT_RESET_MODE_SHIFT       (20U)
/*! OVERVOLT_RESET_MODE - Jtag SW reset mode configuration
 *  0b00..reset system
 *  0b01..reserved
 *  0b10..reserved
 *  0b11..do not reset anything
 */
#define SRC_SRMR_OVERVOLT_RESET_MODE(x)          (((uint32_t)(((uint32_t)(x)) << SRC_SRMR_OVERVOLT_RESET_MODE_SHIFT)) & SRC_SRMR_OVERVOLT_RESET_MODE_MASK)
/*! @} */

/*! @name SBMR1 - SRC Boot Mode Register 1 */
/*! @{ */

#define SRC_SBMR1_BOOT_CFG1_MASK                 (0xFFU)
#define SRC_SBMR1_BOOT_CFG1_SHIFT                (0U)
#define SRC_SBMR1_BOOT_CFG1(x)                   (((uint32_t)(((uint32_t)(x)) << SRC_SBMR1_BOOT_CFG1_SHIFT)) & SRC_SBMR1_BOOT_CFG1_MASK)

#define SRC_SBMR1_BOOT_CFG2_MASK                 (0xFF00U)
#define SRC_SBMR1_BOOT_CFG2_SHIFT                (8U)
#define SRC_SBMR1_BOOT_CFG2(x)                   (((uint32_t)(((uint32_t)(x)) << SRC_SBMR1_BOOT_CFG2_SHIFT)) & SRC_SBMR1_BOOT_CFG2_MASK)

#define SRC_SBMR1_BOOT_CFG3_MASK                 (0xFF0000U)
#define SRC_SBMR1_BOOT_CFG3_SHIFT                (16U)
#define SRC_SBMR1_BOOT_CFG3(x)                   (((uint32_t)(((uint32_t)(x)) << SRC_SBMR1_BOOT_CFG3_SHIFT)) & SRC_SBMR1_BOOT_CFG3_MASK)

#define SRC_SBMR1_BOOT_CFG4_MASK                 (0xFF000000U)
#define SRC_SBMR1_BOOT_CFG4_SHIFT                (24U)
#define SRC_SBMR1_BOOT_CFG4(x)                   (((uint32_t)(((uint32_t)(x)) << SRC_SBMR1_BOOT_CFG4_SHIFT)) & SRC_SBMR1_BOOT_CFG4_MASK)
/*! @} */

/*! @name SBMR2 - SRC Boot Mode Register 2 */
/*! @{ */

#define SRC_SBMR2_SEC_CONFIG_MASK                (0x3U)
#define SRC_SBMR2_SEC_CONFIG_SHIFT               (0U)
#define SRC_SBMR2_SEC_CONFIG(x)                  (((uint32_t)(((uint32_t)(x)) << SRC_SBMR2_SEC_CONFIG_SHIFT)) & SRC_SBMR2_SEC_CONFIG_MASK)

#define SRC_SBMR2_BT_FUSE_SEL_MASK               (0x10U)
#define SRC_SBMR2_BT_FUSE_SEL_SHIFT              (4U)
#define SRC_SBMR2_BT_FUSE_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SBMR2_BT_FUSE_SEL_SHIFT)) & SRC_SBMR2_BT_FUSE_SEL_MASK)

#define SRC_SBMR2_BMOD_MASK                      (0x3000000U)
#define SRC_SBMR2_BMOD_SHIFT                     (24U)
#define SRC_SBMR2_BMOD(x)                        (((uint32_t)(((uint32_t)(x)) << SRC_SBMR2_BMOD_SHIFT)) & SRC_SBMR2_BMOD_MASK)
/*! @} */

/*! @name SRSR - SRC Reset Status Register */
/*! @{ */

#define SRC_SRSR_IPP_RESET_B_M7_MASK             (0x1U)
#define SRC_SRSR_IPP_RESET_B_M7_SHIFT            (0U)
/*! IPP_RESET_B_M7
 *  0b0..Reset is not a result of ipp_reset_b pin.
 *  0b1..Reset is a result of ipp_reset_b pin.
 */
#define SRC_SRSR_IPP_RESET_B_M7(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_IPP_RESET_B_M7_SHIFT)) & SRC_SRSR_IPP_RESET_B_M7_MASK)

#define SRC_SRSR_M7_REQUEST_M7_MASK              (0x2U)
#define SRC_SRSR_M7_REQUEST_M7_SHIFT             (1U)
/*! M7_REQUEST_M7
 *  0b0..Reset is not a result of m7 reset request.
 *  0b1..Reset is a result of m7 reset request.
 */
#define SRC_SRSR_M7_REQUEST_M7(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M7_REQUEST_M7_SHIFT)) & SRC_SRSR_M7_REQUEST_M7_MASK)

#define SRC_SRSR_M7_LOCKUP_M7_MASK               (0x4U)
#define SRC_SRSR_M7_LOCKUP_M7_SHIFT              (2U)
/*! M7_LOCKUP_M7
 *  0b0..Reset is not a result of the mentioned case.
 *  0b1..Reset is a result of the mentioned case.
 */
#define SRC_SRSR_M7_LOCKUP_M7(x)                 (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_M7_LOCKUP_M7_SHIFT)) & SRC_SRSR_M7_LOCKUP_M7_MASK)

#define SRC_SRSR_CSU_RESET_B_M7_MASK             (0x8U)
#define SRC_SRSR_CSU_RESET_B_M7_SHIFT            (3U)
/*! CSU_RESET_B_M7
 *  0b0..Reset is not a result of the csu_reset_b event.
 *  0b1..Reset is a result of the csu_reset_b event.
 */
#define SRC_SRSR_CSU_RESET_B_M7(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_CSU_RESET_B_M7_SHIFT)) & SRC_SRSR_CSU_RESET_B_M7_MASK)

#define SRC_SRSR_IPP_USER_RESET_B_M7_MASK        (0x10U)
#define SRC_SRSR_IPP_USER_RESET_B_M7_SHIFT       (4U)
/*! IPP_USER_RESET_B_M7
 *  0b0..Reset is not a result of the ipp_user_reset_b qualified as COLD reset event.
 *  0b1..Reset is a result of the ipp_user_reset_b qualified as COLD reset event.
 */
#define SRC_SRSR_IPP_USER_RESET_B_M7(x)          (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_IPP_USER_RESET_B_M7_SHIFT)) & SRC_SRSR_IPP_USER_RESET_B_M7_MASK)

#define SRC_SRSR_WDOG_RST_B_M7_MASK              (0x20U)
#define SRC_SRSR_WDOG_RST_B_M7_SHIFT             (5U)
/*! WDOG_RST_B_M7
 *  0b0..Reset is not a result of the watchdog time-out event.
 *  0b1..Reset is a result of the watchdog time-out event.
 */
#define SRC_SRSR_WDOG_RST_B_M7(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_WDOG_RST_B_M7_SHIFT)) & SRC_SRSR_WDOG_RST_B_M7_MASK)

#define SRC_SRSR_JTAG_RST_B_M7_MASK              (0x40U)
#define SRC_SRSR_JTAG_RST_B_M7_SHIFT             (6U)
/*! JTAG_RST_B_M7
 *  0b0..Reset is not a result of HIGH-Z reset from JTAG.
 *  0b1..Reset is a result of HIGH-Z reset from JTAG.
 */
#define SRC_SRSR_JTAG_RST_B_M7(x)                (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_JTAG_RST_B_M7_SHIFT)) & SRC_SRSR_JTAG_RST_B_M7_MASK)

#define SRC_SRSR_JTAG_SW_RST_M7_MASK             (0x80U)
#define SRC_SRSR_JTAG_SW_RST_M7_SHIFT            (7U)
/*! JTAG_SW_RST_M7
 *  0b0..Reset is not a result of software reset from JTAG.
 *  0b1..Reset is a result of software reset from JTAG.
 */
#define SRC_SRSR_JTAG_SW_RST_M7(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_JTAG_SW_RST_M7_SHIFT)) & SRC_SRSR_JTAG_SW_RST_M7_MASK)

#define SRC_SRSR_WDOG3_RST_B_M7_MASK             (0x100U)
#define SRC_SRSR_WDOG3_RST_B_M7_SHIFT            (8U)
/*! WDOG3_RST_B_M7
 *  0b0..Reset is not a result of the watchdog3 time-out event.
 *  0b1..Reset is a result of the watchdog3 time-out event.
 */
#define SRC_SRSR_WDOG3_RST_B_M7(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_WDOG3_RST_B_M7_SHIFT)) & SRC_SRSR_WDOG3_RST_B_M7_MASK)

#define SRC_SRSR_WDOG4_RST_B_M7_MASK             (0x200U)
#define SRC_SRSR_WDOG4_RST_B_M7_SHIFT            (9U)
/*! WDOG4_RST_B_M7
 *  0b0..Reset is not a result of the watchdog4 time-out event.
 *  0b1..Reset is a result of the watchdog4 time-out event.
 */
#define SRC_SRSR_WDOG4_RST_B_M7(x)               (((uint32_t)(((uint32_t)(x)) << SRC_SRSR_WDOG4_RST_B_M7_SHIFT)) & SRC_SRSR_WDOG4_RST_B_M7_MASK)

