RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_SRC.h
#define SRC_AUTHEN_WAKEUP_LOCK_MODE_MASK         (0x80U)
#define SRC_AUTHEN_WAKEUP_LOCK_MODE_SHIFT        (7U)
/*! LOCK_MODE - Domain/Setpoint mode lock */
#define SRC_AUTHEN_WAKEUP_LOCK_MODE(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_LOCK_MODE_SHIFT)) & SRC_AUTHEN_WAKEUP_LOCK_MODE_MASK)

#define SRC_AUTHEN_WAKEUP_ASSIGN_LIST_MASK       (0xF00U)
#define SRC_AUTHEN_WAKEUP_ASSIGN_LIST_SHIFT      (8U)
#define SRC_AUTHEN_WAKEUP_ASSIGN_LIST(x)         (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_ASSIGN_LIST_SHIFT)) & SRC_AUTHEN_WAKEUP_ASSIGN_LIST_MASK)

#define SRC_AUTHEN_WAKEUP_LOCK_ASSIGN_MASK       (0x8000U)
#define SRC_AUTHEN_WAKEUP_LOCK_ASSIGN_SHIFT      (15U)
/*! LOCK_ASSIGN - Assign list lock */
#define SRC_AUTHEN_WAKEUP_LOCK_ASSIGN(x)         (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_LOCK_ASSIGN_SHIFT)) & SRC_AUTHEN_WAKEUP_LOCK_ASSIGN_MASK)

#define SRC_AUTHEN_WAKEUP_WHITE_LIST_MASK        (0xF0000U)
#define SRC_AUTHEN_WAKEUP_WHITE_LIST_SHIFT       (16U)
/*! WHITE_LIST - Domain ID white list */
#define SRC_AUTHEN_WAKEUP_WHITE_LIST(x)          (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_WHITE_LIST_SHIFT)) & SRC_AUTHEN_WAKEUP_WHITE_LIST_MASK)

#define SRC_AUTHEN_WAKEUP_LOCK_LIST_MASK         (0x800000U)
#define SRC_AUTHEN_WAKEUP_LOCK_LIST_SHIFT        (23U)
/*! LOCK_LIST - White list lock */
#define SRC_AUTHEN_WAKEUP_LOCK_LIST(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_LOCK_LIST_SHIFT)) & SRC_AUTHEN_WAKEUP_LOCK_LIST_MASK)

#define SRC_AUTHEN_WAKEUP_USER_MASK              (0x1000000U)
#define SRC_AUTHEN_WAKEUP_USER_SHIFT             (24U)
/*! USER - Allow user mode access */
#define SRC_AUTHEN_WAKEUP_USER(x)                (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_USER_SHIFT)) & SRC_AUTHEN_WAKEUP_USER_MASK)

#define SRC_AUTHEN_WAKEUP_NONSECURE_MASK         (0x2000000U)
#define SRC_AUTHEN_WAKEUP_NONSECURE_SHIFT        (25U)
/*! NONSECURE - Allow non-secure mode access */
#define SRC_AUTHEN_WAKEUP_NONSECURE(x)           (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_NONSECURE_SHIFT)) & SRC_AUTHEN_WAKEUP_NONSECURE_MASK)

#define SRC_AUTHEN_WAKEUP_LOCK_SETTING_MASK      (0x80000000U)
#define SRC_AUTHEN_WAKEUP_LOCK_SETTING_SHIFT     (31U)
/*! LOCK_SETTING - Lock NONSECURE and USER */
#define SRC_AUTHEN_WAKEUP_LOCK_SETTING(x)        (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_WAKEUP_LOCK_SETTING_SHIFT)) & SRC_AUTHEN_WAKEUP_LOCK_SETTING_MASK)
/*! @} */

/*! @name CTRL_WAKEUP - Slice Control Register */
/*! @{ */

#define SRC_CTRL_WAKEUP_SW_RESET_MASK            (0x1U)
#define SRC_CTRL_WAKEUP_SW_RESET_SHIFT           (0U)
/*! SW_RESET
 *  0b0..do not assert slice software reset
 *  0b1..assert slice software reset
 */
#define SRC_CTRL_WAKEUP_SW_RESET(x)              (((uint32_t)(((uint32_t)(x)) << SRC_CTRL_WAKEUP_SW_RESET_SHIFT)) & SRC_CTRL_WAKEUP_SW_RESET_MASK)
/*! @} */

/*! @name SETPOINT_WAKEUP - Slice Setpoint Config Register */
/*! @{ */

#define SRC_SETPOINT_WAKEUP_SETPOINT0_MASK       (0x1U)
#define SRC_SETPOINT_WAKEUP_SETPOINT0_SHIFT      (0U)
/*! SETPOINT0 - SETPOINT0
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT0(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT0_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT0_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT1_MASK       (0x2U)
#define SRC_SETPOINT_WAKEUP_SETPOINT1_SHIFT      (1U)
/*! SETPOINT1 - SETPOINT1
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT1(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT1_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT1_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT2_MASK       (0x4U)
#define SRC_SETPOINT_WAKEUP_SETPOINT2_SHIFT      (2U)
/*! SETPOINT2 - SETPOINT2
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT2(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT2_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT2_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT3_MASK       (0x8U)
#define SRC_SETPOINT_WAKEUP_SETPOINT3_SHIFT      (3U)
/*! SETPOINT3 - SETPOINT3
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT3(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT3_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT3_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT4_MASK       (0x10U)
#define SRC_SETPOINT_WAKEUP_SETPOINT4_SHIFT      (4U)
/*! SETPOINT4 - SETPOINT4
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT4(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT4_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT4_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT5_MASK       (0x20U)
#define SRC_SETPOINT_WAKEUP_SETPOINT5_SHIFT      (5U)
/*! SETPOINT5 - SETPOINT5
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT5(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT5_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT5_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT6_MASK       (0x40U)
#define SRC_SETPOINT_WAKEUP_SETPOINT6_SHIFT      (6U)
/*! SETPOINT6 - SETPOINT6
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT6(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT6_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT6_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT7_MASK       (0x80U)
#define SRC_SETPOINT_WAKEUP_SETPOINT7_SHIFT      (7U)
/*! SETPOINT7 - SETPOINT7
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT7(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT7_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT7_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT8_MASK       (0x100U)
#define SRC_SETPOINT_WAKEUP_SETPOINT8_SHIFT      (8U)
/*! SETPOINT8 - SETPOINT8
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT8(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT8_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT8_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT9_MASK       (0x200U)
#define SRC_SETPOINT_WAKEUP_SETPOINT9_SHIFT      (9U)
/*! SETPOINT9 - SETPOINT9
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT9(x)         (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT9_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT9_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT10_MASK      (0x400U)
#define SRC_SETPOINT_WAKEUP_SETPOINT10_SHIFT     (10U)
/*! SETPOINT10 - SETPOINT10
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT10(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT10_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT10_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT11_MASK      (0x800U)
#define SRC_SETPOINT_WAKEUP_SETPOINT11_SHIFT     (11U)
/*! SETPOINT11 - SETPOINT11
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT11(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT11_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT11_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT12_MASK      (0x1000U)
#define SRC_SETPOINT_WAKEUP_SETPOINT12_SHIFT     (12U)
/*! SETPOINT12 - SETPOINT12
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT12(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT12_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT12_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT13_MASK      (0x2000U)
#define SRC_SETPOINT_WAKEUP_SETPOINT13_SHIFT     (13U)
/*! SETPOINT13 - SETPOINT13
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT13(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT13_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT13_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT14_MASK      (0x4000U)
#define SRC_SETPOINT_WAKEUP_SETPOINT14_SHIFT     (14U)
/*! SETPOINT14 - SETPOINT14
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT14(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT14_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT14_MASK)

#define SRC_SETPOINT_WAKEUP_SETPOINT15_MASK      (0x8000U)
#define SRC_SETPOINT_WAKEUP_SETPOINT15_SHIFT     (15U)
/*! SETPOINT15 - SETPOINT15
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_WAKEUP_SETPOINT15(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_WAKEUP_SETPOINT15_SHIFT)) & SRC_SETPOINT_WAKEUP_SETPOINT15_MASK)
/*! @} */

/*! @name DOMAIN_WAKEUP - Slice Domain Config Register */
/*! @{ */

#define SRC_DOMAIN_WAKEUP_CPU0_RUN_MASK          (0x1U)
#define SRC_DOMAIN_WAKEUP_CPU0_RUN_SHIFT         (0U)
/*! CPU0_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU0 in RUN mode
 *  0b1..Slice reset will be asserted when CPU0 in RUN mode
 */
#define SRC_DOMAIN_WAKEUP_CPU0_RUN(x)            (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_WAKEUP_CPU0_RUN_SHIFT)) & SRC_DOMAIN_WAKEUP_CPU0_RUN_MASK)

#define SRC_DOMAIN_WAKEUP_CPU0_WAIT_MASK         (0x2U)
#define SRC_DOMAIN_WAKEUP_CPU0_WAIT_SHIFT        (1U)
/*! CPU0_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU0 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU0 in WAIT mode
 */
#define SRC_DOMAIN_WAKEUP_CPU0_WAIT(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_WAKEUP_CPU0_WAIT_SHIFT)) & SRC_DOMAIN_WAKEUP_CPU0_WAIT_MASK)

