RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_SRC.h
#define SRC_SETPOINT_M7CORE_SETPOINT14_MASK      (0x4000U)
#define SRC_SETPOINT_M7CORE_SETPOINT14_SHIFT     (14U)
/*! SETPOINT14 - SETPOINT14
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7CORE_SETPOINT14(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7CORE_SETPOINT14_SHIFT)) & SRC_SETPOINT_M7CORE_SETPOINT14_MASK)

#define SRC_SETPOINT_M7CORE_SETPOINT15_MASK      (0x8000U)
#define SRC_SETPOINT_M7CORE_SETPOINT15_SHIFT     (15U)
/*! SETPOINT15 - SETPOINT15
 *  0b0..Slice reset will be de-asserted when system in Setpoint n
 *  0b1..Slice reset will be asserted when system in Setpoint n
 */
#define SRC_SETPOINT_M7CORE_SETPOINT15(x)        (((uint32_t)(((uint32_t)(x)) << SRC_SETPOINT_M7CORE_SETPOINT15_SHIFT)) & SRC_SETPOINT_M7CORE_SETPOINT15_MASK)
/*! @} */

/*! @name DOMAIN_M7CORE - Slice Domain Config Register */
/*! @{ */

#define SRC_DOMAIN_M7CORE_CPU0_RUN_MASK          (0x1U)
#define SRC_DOMAIN_M7CORE_CPU0_RUN_SHIFT         (0U)
/*! CPU0_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU0 in RUN mode
 *  0b1..Slice reset will be asserted when CPU0 in RUN mode
 */
#define SRC_DOMAIN_M7CORE_CPU0_RUN(x)            (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU0_RUN_SHIFT)) & SRC_DOMAIN_M7CORE_CPU0_RUN_MASK)

#define SRC_DOMAIN_M7CORE_CPU0_WAIT_MASK         (0x2U)
#define SRC_DOMAIN_M7CORE_CPU0_WAIT_SHIFT        (1U)
/*! CPU0_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU0 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU0 in WAIT mode
 */
#define SRC_DOMAIN_M7CORE_CPU0_WAIT(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU0_WAIT_SHIFT)) & SRC_DOMAIN_M7CORE_CPU0_WAIT_MASK)

#define SRC_DOMAIN_M7CORE_CPU0_STOP_MASK         (0x4U)
#define SRC_DOMAIN_M7CORE_CPU0_STOP_SHIFT        (2U)
/*! CPU0_STOP - CPU mode setting for STOP
 *  0b0..Slice reset will be de-asserted when CPU0 in STOP mode
 *  0b1..Slice reset will be asserted when CPU0 in STOP mode
 */
#define SRC_DOMAIN_M7CORE_CPU0_STOP(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU0_STOP_SHIFT)) & SRC_DOMAIN_M7CORE_CPU0_STOP_MASK)

#define SRC_DOMAIN_M7CORE_CPU0_SUSP_MASK         (0x8U)
#define SRC_DOMAIN_M7CORE_CPU0_SUSP_SHIFT        (3U)
/*! CPU0_SUSP - CPU mode setting for SUSPEND
 *  0b0..Slice reset will be de-asserted when CPU0 in SUSPEND mode
 *  0b1..Slice reset will be asserted when CPU0 in SUSPEND mode
 */
#define SRC_DOMAIN_M7CORE_CPU0_SUSP(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU0_SUSP_SHIFT)) & SRC_DOMAIN_M7CORE_CPU0_SUSP_MASK)

#define SRC_DOMAIN_M7CORE_CPU1_RUN_MASK          (0x10U)
#define SRC_DOMAIN_M7CORE_CPU1_RUN_SHIFT         (4U)
/*! CPU1_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU1 in RUN mode
 *  0b1..Slice reset will be asserted when CPU1 in RUN mode
 */
#define SRC_DOMAIN_M7CORE_CPU1_RUN(x)            (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU1_RUN_SHIFT)) & SRC_DOMAIN_M7CORE_CPU1_RUN_MASK)

#define SRC_DOMAIN_M7CORE_CPU1_WAIT_MASK         (0x20U)
#define SRC_DOMAIN_M7CORE_CPU1_WAIT_SHIFT        (5U)
/*! CPU1_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU1 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU1 in WAIT mode
 */
#define SRC_DOMAIN_M7CORE_CPU1_WAIT(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU1_WAIT_SHIFT)) & SRC_DOMAIN_M7CORE_CPU1_WAIT_MASK)

#define SRC_DOMAIN_M7CORE_CPU1_STOP_MASK         (0x40U)
#define SRC_DOMAIN_M7CORE_CPU1_STOP_SHIFT        (6U)
/*! CPU1_STOP - CPU mode setting for STOP
 *  0b0..Slice reset will be de-asserted when CPU1 in STOP mode
 *  0b1..Slice reset will be asserted when CPU1 in STOP mode
 */
#define SRC_DOMAIN_M7CORE_CPU1_STOP(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU1_STOP_SHIFT)) & SRC_DOMAIN_M7CORE_CPU1_STOP_MASK)

#define SRC_DOMAIN_M7CORE_CPU1_SUSP_MASK         (0x80U)
#define SRC_DOMAIN_M7CORE_CPU1_SUSP_SHIFT        (7U)
/*! CPU1_SUSP - CPU mode setting for SUSPEND
 *  0b0..Slice reset will be de-asserted when CPU1 in SUSPEND mode
 *  0b1..Slice reset will be asserted when CPU1 in SUSPEND mode
 */
#define SRC_DOMAIN_M7CORE_CPU1_SUSP(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_M7CORE_CPU1_SUSP_SHIFT)) & SRC_DOMAIN_M7CORE_CPU1_SUSP_MASK)
/*! @} */

/*! @name STAT_M7CORE - Slice Status Register */
/*! @{ */

#define SRC_STAT_M7CORE_UNDER_RST_MASK           (0x1U)
#define SRC_STAT_M7CORE_UNDER_RST_SHIFT          (0U)
/*! UNDER_RST
 *  0b0..the reset is finished
 *  0b1..the reset is in process
 */
#define SRC_STAT_M7CORE_UNDER_RST(x)             (((uint32_t)(((uint32_t)(x)) << SRC_STAT_M7CORE_UNDER_RST_SHIFT)) & SRC_STAT_M7CORE_UNDER_RST_MASK)

#define SRC_STAT_M7CORE_RST_BY_HW_MASK           (0x4U)
#define SRC_STAT_M7CORE_RST_BY_HW_SHIFT          (2U)
/*! RST_BY_HW
 *  0b0..the reset is not caused by the power mode transfer
 *  0b1..the reset is caused by the power mode transfer
 */
#define SRC_STAT_M7CORE_RST_BY_HW(x)             (((uint32_t)(((uint32_t)(x)) << SRC_STAT_M7CORE_RST_BY_HW_SHIFT)) & SRC_STAT_M7CORE_RST_BY_HW_MASK)

#define SRC_STAT_M7CORE_RST_BY_SW_MASK           (0x8U)
#define SRC_STAT_M7CORE_RST_BY_SW_SHIFT          (3U)
/*! RST_BY_SW
 *  0b0..the reset is not caused by software setting
 *  0b1..the reset is caused by software setting
 */
#define SRC_STAT_M7CORE_RST_BY_SW(x)             (((uint32_t)(((uint32_t)(x)) << SRC_STAT_M7CORE_RST_BY_SW_SHIFT)) & SRC_STAT_M7CORE_RST_BY_SW_MASK)
/*! @} */

/*! @name AUTHEN_M4DEBUG - Slice Authentication Register */
/*! @{ */

#define SRC_AUTHEN_M4DEBUG_DOMAIN_MODE_MASK      (0x1U)
#define SRC_AUTHEN_M4DEBUG_DOMAIN_MODE_SHIFT     (0U)
/*! DOMAIN_MODE
 *  0b0..slice hardware reset will NOT be triggered by CPU power mode transition
 *  0b1..slice hardware reset will be triggered by CPU power mode transition. Do not set this bit and SETPOINT_MODE at the same time.
 */
#define SRC_AUTHEN_M4DEBUG_DOMAIN_MODE(x)        (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_M4DEBUG_DOMAIN_MODE_SHIFT)) & SRC_AUTHEN_M4DEBUG_DOMAIN_MODE_MASK)

