RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_SRC.h
#define SRC_DOMAIN_USBPHY1_CPU0_SUSP_MASK        (0x8U)
#define SRC_DOMAIN_USBPHY1_CPU0_SUSP_SHIFT       (3U)
/*! CPU0_SUSP - CPU mode setting for SUSPEND
 *  0b0..Slice reset will be de-asserted when CPU0 in SUSPEND mode
 *  0b1..Slice reset will be asserted when CPU0 in SUSPEND mode
 */
#define SRC_DOMAIN_USBPHY1_CPU0_SUSP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU0_SUSP_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU0_SUSP_MASK)

#define SRC_DOMAIN_USBPHY1_CPU1_RUN_MASK         (0x10U)
#define SRC_DOMAIN_USBPHY1_CPU1_RUN_SHIFT        (4U)
/*! CPU1_RUN - CPU mode setting for RUN
 *  0b0..Slice reset will be de-asserted when CPU1 in RUN mode
 *  0b1..Slice reset will be asserted when CPU1 in RUN mode
 */
#define SRC_DOMAIN_USBPHY1_CPU1_RUN(x)           (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU1_RUN_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU1_RUN_MASK)

#define SRC_DOMAIN_USBPHY1_CPU1_WAIT_MASK        (0x20U)
#define SRC_DOMAIN_USBPHY1_CPU1_WAIT_SHIFT       (5U)
/*! CPU1_WAIT - CPU mode setting for WAIT
 *  0b0..Slice reset will be de-asserted when CPU1 in WAIT mode
 *  0b1..Slice reset will be asserted when CPU1 in WAIT mode
 */
#define SRC_DOMAIN_USBPHY1_CPU1_WAIT(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU1_WAIT_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU1_WAIT_MASK)

#define SRC_DOMAIN_USBPHY1_CPU1_STOP_MASK        (0x40U)
#define SRC_DOMAIN_USBPHY1_CPU1_STOP_SHIFT       (6U)
/*! CPU1_STOP - CPU mode setting for STOP
 *  0b0..Slice reset will be de-asserted when CPU1 in STOP mode
 *  0b1..Slice reset will be asserted when CPU1 in STOP mode
 */
#define SRC_DOMAIN_USBPHY1_CPU1_STOP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU1_STOP_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU1_STOP_MASK)

#define SRC_DOMAIN_USBPHY1_CPU1_SUSP_MASK        (0x80U)
#define SRC_DOMAIN_USBPHY1_CPU1_SUSP_SHIFT       (7U)
/*! CPU1_SUSP - CPU mode setting for SUSPEND
 *  0b0..Slice reset will be de-asserted when CPU1 in SUSPEND mode
 *  0b1..Slice reset will be asserted when CPU1 in SUSPEND mode
 */
#define SRC_DOMAIN_USBPHY1_CPU1_SUSP(x)          (((uint32_t)(((uint32_t)(x)) << SRC_DOMAIN_USBPHY1_CPU1_SUSP_SHIFT)) & SRC_DOMAIN_USBPHY1_CPU1_SUSP_MASK)
/*! @} */

/*! @name STAT_USBPHY1 - Slice Status Register */
/*! @{ */

#define SRC_STAT_USBPHY1_UNDER_RST_MASK          (0x1U)
#define SRC_STAT_USBPHY1_UNDER_RST_SHIFT         (0U)
/*! UNDER_RST
 *  0b0..the reset is finished
 *  0b1..the reset is in process
 */
#define SRC_STAT_USBPHY1_UNDER_RST(x)            (((uint32_t)(((uint32_t)(x)) << SRC_STAT_USBPHY1_UNDER_RST_SHIFT)) & SRC_STAT_USBPHY1_UNDER_RST_MASK)

#define SRC_STAT_USBPHY1_RST_BY_HW_MASK          (0x4U)
#define SRC_STAT_USBPHY1_RST_BY_HW_SHIFT         (2U)
/*! RST_BY_HW
 *  0b0..the reset is not caused by the power mode transfer
 *  0b1..the reset is caused by the power mode transfer
 */
#define SRC_STAT_USBPHY1_RST_BY_HW(x)            (((uint32_t)(((uint32_t)(x)) << SRC_STAT_USBPHY1_RST_BY_HW_SHIFT)) & SRC_STAT_USBPHY1_RST_BY_HW_MASK)

#define SRC_STAT_USBPHY1_RST_BY_SW_MASK          (0x8U)
#define SRC_STAT_USBPHY1_RST_BY_SW_SHIFT         (3U)
/*! RST_BY_SW
 *  0b0..the reset is not caused by software setting
 *  0b1..the reset is caused by software setting
 */
#define SRC_STAT_USBPHY1_RST_BY_SW(x)            (((uint32_t)(((uint32_t)(x)) << SRC_STAT_USBPHY1_RST_BY_SW_SHIFT)) & SRC_STAT_USBPHY1_RST_BY_SW_MASK)
/*! @} */

/*! @name AUTHEN_USBPHY2 - Slice Authentication Register */
/*! @{ */

#define SRC_AUTHEN_USBPHY2_DOMAIN_MODE_MASK      (0x1U)
#define SRC_AUTHEN_USBPHY2_DOMAIN_MODE_SHIFT     (0U)
/*! DOMAIN_MODE
 *  0b0..slice hardware reset will NOT be triggered by CPU power mode transition
 *  0b1..slice hardware reset will be triggered by CPU power mode transition. Do not set this bit and SETPOINT_MODE at the same time.
 */
#define SRC_AUTHEN_USBPHY2_DOMAIN_MODE(x)        (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_DOMAIN_MODE_SHIFT)) & SRC_AUTHEN_USBPHY2_DOMAIN_MODE_MASK)

#define SRC_AUTHEN_USBPHY2_SETPOINT_MODE_MASK    (0x2U)
#define SRC_AUTHEN_USBPHY2_SETPOINT_MODE_SHIFT   (1U)
/*! SETPOINT_MODE
 *  0b0..slice hardware reset will NOT be triggered by Setpoint transition
 *  0b1..slice hardware reset will be triggered by Setpoint transition. Do not set this bit and DOMAIN_MODE at the same time.
 */
#define SRC_AUTHEN_USBPHY2_SETPOINT_MODE(x)      (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_SETPOINT_MODE_SHIFT)) & SRC_AUTHEN_USBPHY2_SETPOINT_MODE_MASK)

#define SRC_AUTHEN_USBPHY2_LOCK_MODE_MASK        (0x80U)
#define SRC_AUTHEN_USBPHY2_LOCK_MODE_SHIFT       (7U)
/*! LOCK_MODE - Domain/Setpoint mode lock */
#define SRC_AUTHEN_USBPHY2_LOCK_MODE(x)          (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_LOCK_MODE_SHIFT)) & SRC_AUTHEN_USBPHY2_LOCK_MODE_MASK)

#define SRC_AUTHEN_USBPHY2_ASSIGN_LIST_MASK      (0xF00U)
#define SRC_AUTHEN_USBPHY2_ASSIGN_LIST_SHIFT     (8U)
#define SRC_AUTHEN_USBPHY2_ASSIGN_LIST(x)        (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_ASSIGN_LIST_SHIFT)) & SRC_AUTHEN_USBPHY2_ASSIGN_LIST_MASK)

#define SRC_AUTHEN_USBPHY2_LOCK_ASSIGN_MASK      (0x8000U)
#define SRC_AUTHEN_USBPHY2_LOCK_ASSIGN_SHIFT     (15U)
/*! LOCK_ASSIGN - Assign list lock */
#define SRC_AUTHEN_USBPHY2_LOCK_ASSIGN(x)        (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_LOCK_ASSIGN_SHIFT)) & SRC_AUTHEN_USBPHY2_LOCK_ASSIGN_MASK)

#define SRC_AUTHEN_USBPHY2_WHITE_LIST_MASK       (0xF0000U)
#define SRC_AUTHEN_USBPHY2_WHITE_LIST_SHIFT      (16U)
/*! WHITE_LIST - Domain ID white list */
#define SRC_AUTHEN_USBPHY2_WHITE_LIST(x)         (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_WHITE_LIST_SHIFT)) & SRC_AUTHEN_USBPHY2_WHITE_LIST_MASK)

#define SRC_AUTHEN_USBPHY2_LOCK_LIST_MASK        (0x800000U)
#define SRC_AUTHEN_USBPHY2_LOCK_LIST_SHIFT       (23U)
/*! LOCK_LIST - White list lock */
#define SRC_AUTHEN_USBPHY2_LOCK_LIST(x)          (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_LOCK_LIST_SHIFT)) & SRC_AUTHEN_USBPHY2_LOCK_LIST_MASK)

#define SRC_AUTHEN_USBPHY2_USER_MASK             (0x1000000U)
#define SRC_AUTHEN_USBPHY2_USER_SHIFT            (24U)
/*! USER - Allow user mode access */
#define SRC_AUTHEN_USBPHY2_USER(x)               (((uint32_t)(((uint32_t)(x)) << SRC_AUTHEN_USBPHY2_USER_SHIFT)) & SRC_AUTHEN_USBPHY2_USER_MASK)

